[{"title": "Ratan Tata invests in Ola's newly-formed company Ola Electric", "content": "Ratan Tata, the Chairman Emeritus of Tata Sons, has invested an undisclosed amount in Ola's newly-formed company Ola Electric Mobility as part of its Series A round of funding. Tata is also an early investor in ANI Technologies, Ola's parent company. Ola Electric had raised ₹400 crore in March this year from Tiger Global, Matrix Partners India and others.", "category": "business"}, {"title": "Got ₹1L cr of contracts during UPA rule: Reliance on Rahul's remark", "content": "After Rahul Gandhi called Anil Ambani a crony capitalist, the Reliance Group on Sunday said it got over ₹1 lakh crore of contracts during the Congress rule between 2004 and 2014. \"We request Rahul Gandhi to clarify whether his government, for 10 long years, was supporting an alleged crony capitalist and dishonest businessman,\" the group added.", "category": "business"}, {"title": "Malicious lies: Anil Ambani's Reliance on Rahul Gandhi's claims", "content": "The Reliance Group has accused Rahul Gandhi of engaging in \"calumny, disinformation, distortion and malicious lies\", after the Congress President called Anil Ambani a \"crony capitalist\". The group added it got over ₹1 lakh crore of contracts during the Congress-led UPA regime from 2004 to 2014. \"[Was Rahul's] government, for 10 long years...supporting an alleged crony capitalist,\" it stated.", "category": "business"}, {"title": "No new taxes on the middle class to finance NYAY, says ex-PM Singh", "content": "On being asked how Congress will fund its NYAY scheme if elected, ex-PM Manmohan Singh said India's GDP will increase from ₹210 trillion to ₹400 trillion in five years. NYAY will cost just 1.5% of GDP to cover five crore poor families and any new taxes on the middle class to finance NYAY won't be needed, the ex-Finance Minister said.", "category": "business"}, {"title": "SC stays NGT's ₹500 crore fine on Volkswagen for 'cheat device'", "content": "The Supreme Court on Monday stayed the ₹500-crore fine the National Green Tribunal (NGT) imposed on German automaker Volkswagen for damaging the environment with 'cheat device' in its diesel cars sold in India. The SC said \"no coercive steps be taken against the company\" until it hears the matter. It also agreed to hear Volkswagen's plea against the NGT penalty.", "category": "business"}, {"title": "4th richest man Buffett says Tesla can't sell insurance, Musk responds", "content": "After world's fourth-richest person Warren Buffett claimed carmaker Tesla cannot sell insurance, Tesla's CEO Elon Musk responded with a series of tweets on Sunday. In his first tweet, Musk urged users to buy Tesla Model 3, claiming it's cheaper than a Honda Accord. \"Also 1000 times more fun!\" and \"That's a direct quote from Warren Buffett,\" his next tweets read.", "category": "business"}, {"title": "I'll never hesitate to fly on 737 MAX: Buffett on crashes killing 346", "content": "World's fourth-richest person, Warren Buffett, has said that he will \"never hesitate even for a second to fly on a Boeing 737 MAX plane\" which was involved in two crashes that claimed the lives of 346 people. He was responding to a question about damage to Boeing's reputation after the crashes. \"Planes have never been so safe,\" Buffett added.", "category": "business"}, {"title": "ONGC cash reserves shrink to ₹167 cr from ₹9,511 cr in 1.5 yrs", "content": "India's largest oil producer ONGC's cash reserves stood at ₹167 crore as of September 2018, down 98% from ₹9,511 crore in March 2017. This comes amid the government urging state-run firms to give more dividends or announce share buybacks to meet fiscal deficit targets. ONGC acquired Hindustan Petroleum (HPCL) last year, as part of government's efforts to meet disinvestment targets.", "category": "business"}, {"title": "Yes Bank slips to 10th most valuable Indian bank from 7th for 1st time", "content": "Yes Bank has slipped three spots to 10th spot in market valuation for the first time as its shares slumped over 30% in the last two trading sessions. This comes after it reported ₹1,500-crore net loss for its March quarter earnings. HDFC Bank is the most valued Indian bank with ₹6.34 trillion market valuation, followed by SBI and Kotak Mahindra.", "category": "business"}, {"title": "No crime in Huawei leak: UK police after defence secy sacked", "content": "The British police has said the leak of information from UK's National Security Council that recently led to defence secretary Gavin Williamson's firing didn't constitute a crime, and declined to investigate the matter. The leak claimed that China's Huawei had been allowed to develop UK's 5G network. Williamson denied leaking discussions and had sought police investigation to clear his name.", "category": "business"}, {"title": "Inaccurate, unfair: Xiaomi on reported Q1 phone shipment figures", "content": "China's Xiaomi has released a statement disputing the estimated smartphone shipment numbers for the first quarter of 2019 mentioned in media reports quoting \"certain market research institutions\". Calling the information \"inaccurate\" and \"unfair\", Xiaomi said it shipped over 27.5 million smartphones globally in the period. Market research firm IDC had pegged it at 25 million units.", "category": "business"}, {"title": "Bitcoin is like a seashell, not an investment: Warren Buffett", "content": "Berkshire Hathaway CEO Warren Buffett, while talking about Bitcoin said, \"It doesn't do anything. It just sits there. It's like a seashell or something, and that is not an investment to me.\" Buffett also called Bitcoin a \"gambling device\", which has many frauds connected with it. However, he acknowledged that blockchain technology holds promise, adding that it didn't need Bitcoin.", "category": "business"}, {"title": "Infibeam terminates EY affiliated auditor citing data breach", "content": "E-commerce conglomerate Infibeam Avenues' board recommended terminating services of its auditor SRBC & Co, affiliated to Ernst & Young. Infibeam alleged that the auditor had shared its Unpublished Price Sensitive Information (UPSI) with personal email accounts of their team and third party multiple times. However, the auditor refuted all allegations and said it is open to regulatory inspection.", "category": "business"}, {"title": "PepsiCo India withdraws lawsuit against two Gujarat farmers", "content": "PepsiCo India withdrew its lawsuit against two farmers at Gujarat's Deesa on Monday, nearly a month after they were filed. The maker of Lay's chips had sued the brothers, over \"issues around its seed protection\" and sought ₹20 lakh in damages. Notably, the farmers are on the board of a Deesa-based potato chips company, Tirupati Balaji Chips Potato.", "category": "business"}, {"title": "IMF official replaces fired Pak central bank Guv amid rescue talks", "content": "Pakistan on Sunday named International Monetary Fund (IMF) economist Reza Baqir as the Governor of the State Bank of Pakistan. Tariq Bajwa, who had previously held the post, was fired along with the head of the tax collection body on Friday, owing to their \"performance\". The appointment comes amid Pakistan's bailout negotiations with the IMF.", "category": "business"}, {"title": "Using all means to sell oil in grey market: Iran amid US sanctions", "content": "Iran's Deputy Oil Minister has said the country has mobilised all its resources to sell oil in a \"grey market\", bypassing US sanctions. \"This is not smuggling. This is countering sanctions which we do not see as just or legitimate,\" he said. The US has told importers of Iranian oil to stop purchases by May 1 or face sanctions.", "category": "business"}, {"title": "India warns WTO about EU's proposal for new e-commerce rules", "content": "India has warned the World Trade Organisation (WTO) against the proposal made by the European Union to create new e-commerce rules. India said the high standards being proposed could affect the goods and services tariff rules under the WTO, impacting the country's domestic industry and job creation. Most developing countries are not ready for binding rules in e-commerce, it added.", "category": "business"}, {"title": "Ex-bosses at French telco on trial over workers' suicides", "content": "French telco Orange's ex-CEO Didier Lombard, along with six other former executives, will go on trial on Monday over a series of staff suicides between 2008-2010. Prosecutors listed around 18 suicides and 13 suicide attempts by employees, including an incident where a worker stabbed himself during a meeting. Job cuts and stressful working conditions led to the suicides, prosecutors said.", "category": "business"}, {"title": "Govt has little hope of finding buyer for Jet Airways: Reports", "content": "The government sees little hope of a bidder emerging for cash-strapped Jet Airways, reports said citing government sources. Parties that had initially expressed interest in Jet, which is in over $1-billion debt, have reportedly failed to make firm bids. The temporarily grounded airline's bidding process, for which four suitors have reportedly been shortlisted, will be finalised by May 10.", "category": "business"}, {"title": "Boeing admits some 737 MAX planes had safety alert issue", "content": "Boeing on Sunday revealed some of its 737 MAX planes were accidentally delivered with a cockpit safety alert as an optional addition, rather than a standard feature. The planemaker added it didn't inform the US aviation regulator FAA about this for 13 months despite being aware of the situation. Boeing further insisted that the missing display represented no safety risk.", "category": "business"}, {"title": "Cognizant may cut jobs as it slashes growth forecast by half", "content": "American IT giant Cognizant announced it is considering job cuts, after the company nearly halved its 2019 revenue expectations from the 7-9% range to around 3.6-5%. The company's headcount growth had outstripped revenue growth in the past two quarters, it said. The job cuts are most likely to hit employees working at the middle level, as per reports.", "category": "business"}, {"title": "L&T buys Mindtree shares worth ₹113 crore via open market", "content": "Infrastructure major Larsen & Toubro (L&T) on Monday bought shares of Mindtree worth about ₹113 crore through open market transactions. It purchased over 11.52 lakh shares, or 0.75% stake, with the average price being ₹979.94 per share. L&T had last week purchased around 20% stake of VG Siddhartha and Coffee Day in Mindtree through block deal for about ₹3,210 crore.", "category": "business"}, {"title": "ICICI Bank profit falls 5% to ₹969 crore in March quarter", "content": "Private lender ICICI Bank on Monday posted a profit of ₹969 crore for the March quarter, a 5% decline from the corresponding quarter last year. Total expenses jumped 18% to ₹14,680 crore, led by a 17% rise in interest paid by the lender on deposits. ICICI Bank said it has classified exposure worth ₹276 crore to IL&FS as bad loans.", "category": "business"}, {"title": "Bharti Airtel profit rises 30% to ₹107 cr in fourth quarter", "content": "Telecom major Bharti Airtel on Monday posted a nearly 30% year-on-year rise in profit at ₹107 crore for the quarter ended March 31, 2019. The Sunil Mittal-led company's profit was boosted by an exceptional gain worth ₹2,022 crore during the quarter. The company's revenue during the quarter stood at ₹20,656 crore, a 6% rise from the year-ago period.", "category": "business"}, {"title": "China is a big opportunity for Sun Pharma: Founder Shanghvi", "content": "India's largest drugmaker Sun Pharma is looking for a partner to facilitate expansion in China. \"There is a big opportunity for us [in China],\" Founder Dilip Shanghvi said, adding that the company will start scaling up its China business in six to nine months. The unit is expected to contribute significantly to Sun Pharma's $4-billion overall sales within three years.", "category": "business"}, {"title": "Fan asks Unadkat to join academy to learn how to bowl, he responds", "content": "RR pacer Jaydev Unadkat took to Twitter to respond to a cricket fan, who asked him to enrol into an academy and learn how to bowl. \"Yes boss...already enrolled into one and will forever be enrolled, till the time I keep playing this game passionately. Because learning never stops....Hope you guys learnt something from hurling abuses to me,\" he wrote.", "category": "sports"}, {"title": "SRH 1st team to reach IPL playoffs with 12 points as MI beat KKR", "content": "Mumbai Indians defeated Kolkata Knight Riders by nine wickets on Sunday to finish the league stage of an IPL edition on top of the points table for the third time. With the defeat, Kolkata Knight Riders got eliminated from IPL 2019, while SunRisers Hyderabad became the first ever team to advance to playoffs in an IPL edition with 12 points.", "category": "sports"}, {"title": "She was asleep when I hit 50: Rohit on dedicating knock to daughter", "content": "MI captain Rohit Sharma dedicated his fifty against KKR on Sunday to his daughter Samaira after celebrating it by rocking his bat in his arms. \"My daughter has been coming here every day to watch me play, but I didn't get lot of runs earlier. It was nice to get some runs today, but she was sleeping!\" he later said.", "category": "sports"}, {"title": "MS Dhoni votes in Ranchi, shares video of Ziva urging people to vote", "content": "A day after featuring in the Chennai Super Kings-Kings XI Punjab IPL 2019 match in Punjab's Mohali, former India captain MS Dhoni cast his vote along with his family in Jharkhand's Ranchi. The 37-year-old later shared a video of his daughter Ziva urging Indian citizens to vote, saying, \"Go and vote just like Mumma and Papa did.\"", "category": "sports"}, {"title": "Bhogle clarifies after mistakenly snubbing Hardik Pandya's handshake", "content": "Commentator Harsha Bhogle took to Twitter to clarify after mistakenly snubbing MI all-rounder Hardik Pandya's handshake during post-match presentation on Sunday. \"Was good to chat with Hardik at post-game presentation. I find him very easy to talk to. I had to turn to camera at the end and completely missed his handshake. Hope it didn't look too odd!\" he wrote.", "category": "sports"}, {"title": "KXIP beat CSK as RCB finish last in IPL for 2nd time in 3 years", "content": "KXIP defeated CSK by six wickets in the IPL 2019 on Sunday. The match witnessed KXIP opener KL Rahul slam the third fastest fifty of the season off 19 balls despite opening his account on the sixth delivery he faced. With KXIP's victory, RCB slipped to the eighth position, finishing last in IPL for second time in last three years.", "category": "sports"}, {"title": "Mandhana's Trailblazers beat Harmanpreet's Supernovas on last ball", "content": "Smriti Mandhana-led Trailblazers defeated Harmanpreet Kaur-led Supernovas on last ball of the first match of Women's T20 Challenge at Jaipur's Sawai Mansingh Stadium on Monday. Requiring 19 runs off the last over, Supernovas' captain Harmanpreet Kaur slammed four boundaries off the first five deliveries before Lea Tahuhu got run-out of the last ball. Trailblazers will next face Velocity on Wednesday.", "category": "sports"}, {"title": "Rayudu, Shankar end IPL 2019 league stage with identical numbers", "content": "In a coincidence, Chennai Super Kings batsman Ambati Rayudu and SunRisers Hyderabad all-rounder Vijay Shankar ended IPL 2019 league stage with identical batting statistics. Both the players scored 219 runs in 14 matches. Notably, Shankar was included in India's squad for the upcoming World Cup as a number four batting probable instead of Rayudu.", "category": "sports"}, {"title": "What are the matchups for the IPL 2019 playoffs?", "content": "Mumbai Indians and Chennai Super Kings finished as top two teams on the IPL 2019 points table and will play the Qualifier 1 on Tuesday. The winner will reach the final while the loser will play the winner of the Eliminator between Delhi Capitals and SunRisers Hyderabad. The winner of the Qualifier 2 will qualify for the final.", "category": "sports"}, {"title": "Feminists can say what they want: Afridi on no cricket for daughters", "content": "Former Pakistan captain Shahid Afridi, in his book, said that he has given permission to his four daughters to play any sport as long as they are indoors. \"Cricket is not for my girls,\" he added. \"The feminists can say what they want; as a conservative Pakistani father, I have made my decision,\" he further said.", "category": "sports"}, {"title": "Windies record ODI cricket's first-ever 350+ run opening stand", "content": "Windies' John Campbell and Shai Hope recorded ODI cricket history's first-ever 350-plus run opening stand after sharing 365 runs for the first wicket against Ireland on Sunday. The previous highest opening stand in ODI cricket of 304 runs was recorded by Pakistan's Fakhar Zaman and Imam-ul-Haq against Zimbabwe last year. Overall, it was ODI cricket's second-highest partnership for any wicket.", "category": "sports"}, {"title": "Afridi may be 36, 37 years old, but he is 16 mentally: Gambhir", "content": "Cricketer-turned-politician Gautam Gambhir has said ex-Pakistan captain Shahid Afridi may be 36, 37 years old but he is 16 mentally. Further, reacting to Afridi's remarks that he doesn't have any great records, Gambhir said, \"My records are in open. People will decide what I've done for India.\" Earlier, Gambhir had said he would take Afridi to a psychiatrist in India.", "category": "sports"}, {"title": "BCCI responsible for the situation: Sachin on 'conflict of interest'", "content": "Sachin Tendulkar has rejected BCCI's observation that his alleged conflict of interest falls under \"tractable category\", saying the board is \"responsible for the current situation\". Sachin requested BCCI Ethics Officer to call CoA chief and BCCI CEO to \"clarify their position\". Sachin added it was unfortunate he had to clarify questions regarding his role as CAC member and MI mentor.", "category": "sports"}, {"title": "Transformed England favourites to win 2019 World Cup: Gavaskar", "content": "Former India captain Sunil Gavaskar has said that England are the favourites to win the 2019 World Cup, which will take place in England and Wales from May 30 to July 14. \"Simply because of the way they are playing cricket, the complete turnaround in their cricketing attitude and approach after their disastrous 2015 World Cup,\" he added.", "category": "sports"}, {"title": "We picked Ishant based on his tremendous Test form: Kaif", "content": "Delhi Capitals' assistant coach Mohammad Kaif said that pacer Ishant Sharma has been a 'big' factor in the side's success this year and that he was picked based on his 'tremendous' Test form for India. Sharma had gone unsold last season after having managed to pick a total of seven wickets in his last four IPL seasons.", "category": "sports"}, {"title": "2nd half has been good, doesn't feel like a bad season: Kohli", "content": "Royal Challengers Bangalore captain Virat Kohli said, \"[B]ecause the second half has been so good it doesn't feel like a bad season.\" \"We won last five of our seven matches, with one no-result, it is something that we can be proud of,\" Kohli said about his side, which failed to reach the playoffs stage of the tournament this year.", "category": "sports"}, {"title": "I've learnt a lot from Kohli, ABD: RCB's Hetmyer after win vs SRH", "content": "Royal Challengers Bangalore's Windies cricketer Shimron Hetmyer, who hit a match-winning 75 runs off 47 balls against SunRisers Hyderabad, said that he has learnt a lot from Virat Kohli and AB de Villiers. \"I am just trying to take my game one step at a time and just try to move up in whatever way I can,\" Hetmyer added.", "category": "sports"}, {"title": "Kedar Jadhav likely to miss remainder of IPL 2019", "content": "Chennai Super Kings all-rounder Kedar Jadhav is likely to miss the rest of the IPL 2019 due to a shoulder injury he picked up in the side's match against Kings XI Punjab. \"He’s getting an X-Ray and a scan tomorrow, so we’re hopeful for him. I don’t think we’ll see him again in this tournament,\" CSK coach Stephen Fleming said.", "category": "sports"}, {"title": "Diaz scores brace for Real Madrid in win vs Villarreal", "content": "Mariano Diaz scored a brace in Real Madrid's 3-2 win over Villarreal in the La Liga on Sunday. The match also witnessed Jesus Vallejo score his first goal for Real Madrid, who were playing without Karim Benzema. Real Madrid have now registered five wins in a row at their home stadium.", "category": "sports"}, {"title": "I’m not focusing on World Cup spot: Jofra Archer after Eng debut", "content": "After making his England debut Jofra Archer said that his England teammates have been very welcoming and that he is not focusing on making it to England's World Cup squad. \"I’ll just try to play well and hope, I guess. I’ll try not to set my heart on it... I won’t feel too bad if I’m left out,\" Archer said.", "category": "sports"}, {"title": "Chelsea reach third spot with win over Watford", "content": "Chelsea reached the third spot in the Premier League table after beating Watford 3-0 at the Stamford Bridge on Sunday. The win came after goals from Ruben Loftus-Cheek, David Luiz, and Gonzalo Higuain, with assists for the first two goals coming from Eden Hazard. Chelsea are a place and point above Tottenham Hotspur.", "category": "sports"}, {"title": "Sylvester Stallone happy to share UFC equity with McGregor", "content": "Hollywood actor Sylvester Stallone has said that he would be happy to share his UFC equity with Irish MMA fighter and wrestler Conor McGregor. McGregor had earlier jokingly offered to fight Hollywood actor Mark Wahlberg and US talk show host Conan O'Brien for their UFC shares. McGregor hasn't fought in the UFC since his UFC 229 defeat to Khabib Nurmagomedov.", "category": "sports"}, {"title": "BCCI treasurer questions Afridi's failure to inform about fixing", "content": "BCCI treasurer Anirudh Chaudhry has brought up former Pakistan skipper Shahid Afridi's action of not reporting the 2010 spot-fixing matter to ICC's Anti-Corruption Unit, despite claiming that he was aware of it. The official rule states that participants must report all approaches, or information regarding corrupt conduct to the appropriate ACU, without unnecessary delay.", "category": "sports"}, {"title": "Ex-Pak captain Younis rejects PCB's offer to coach U-19 team", "content": "Former Pakistan captain Younis Khan has rejected the offer to coach Pakistan's U-19 team. Khan, the only Pakistan batsman to score 10,000-plus Test runs, reportedly wanted the dual role of head coach and chief selector of U-19 side, which PCB declined citing 'conflict of interest'. \"The idea was to have a high-profile cricketer work with the juniors,\" an official said.", "category": "sports"}, {"title": "OnePlus confirms HDR10+ display for OnePlus 7 Pro ahead of launch", "content": "OnePlus has revealed the OnePlus 7 Pro will feature HDR10+ display, which makes the screen compatible with high resolution content from streaming services like Youtube and Netflix. HDR10+ technology produces 4000 nits of peak brightness, an increase of about 3000 nits compared to HDR10. It also delivers frame-by-frame adjustments for better representation of contrast from the HDR source content.", "category": "technology"}, {"title": "People give 5-stars to Delhi 'Mountain of Garbage' on Google Maps", "content": "Several people are locating East Delhi's Ghazipur's 'Mountain of Garbage' on Google Maps and leaving 5-star reviews, bringing its average rating to 4.1 stars. In 2018, the landfill stood at a height of 65 metres, eight metres less than the Qutub Minar. \"This place has a beautiful aroma which you can only find here,\" one of the sarcastic reviews read.", "category": "technology"}, {"title": "Myntra Senior VP Sharath Bulusu quits to rejoin Google", "content": "Sharath Bulusu, a Senior Vice President at Flipkart's fashion platform Myntra has left the company and rejoined Google, as per his LinkedIn profile. Bulusu, a former Google executive and Chief Product Officer (CPO) at London-based HouseTrip, had joined Myntra in 2016. Bulusu has joined Google as product management director. Interestingly, Myntra CPO Ambarish Kenghe left last year to rejoin Google.", "category": "technology"}, {"title": "Balaji Srinivasan, first CTO of Coinbase, quits after 1 year", "content": "Balaji Srinivasan, Chief Technology Officer of crypto exchange Coinbase, last valued at $8 billion, has announced his departure. Srinivasan became the company's first CTO one year ago after it acquired Earn.com, where he was CEO and Co-founder. \"The Earn integration was successful and we've closed ~$200M in deals for the new Coinbase Earn,\" Srinivasan tweeted thanking Coinbase CEO Brian Armstrong.", "category": "technology"}, {"title": "US farming startup starts selling vegetables grown by robot", "content": "Iron Ox has said it has started selling lettuce and basil grown by its robots at a nearby California-based store. The startup, which launched last October, said robot farms can be located nearer to customers and save transportation cost because of their smaller physical footprint. Iron Ox uses AI-powered robot arms to tend crops, however, seeds are sown by humans.", "category": "technology"}, {"title": "Buffett & I just sat sucking our thumbs: Munger on not buying Google", "content": "Berkshire Hathaway Vice Chairman Charlie Munger said not buying Google shares was one of his and Warren Buffett's biggest regrets. Munger said he and Buffett saw how great search engine optimization was used in a Berkshire company and \"we just sat there sucking our thumbs\". \"I feel like a horse's ass for not identifying Google earlier...We screwed up,\" Munger added.", "category": "technology"}, {"title": "Ex-Googler reveals how they plotted to kill Internet Explorer", "content": "A former Google employee has revealed how a group of engineers plotted to kill Internet Explorer 6 in 2009. YouTube started displaying a banner to IE6 users, warning that support for Microsoft's browser would be \"phasing out\" soon. \"Within one month, 10% of global IE6 traffic had dropped off... while all other browsers increased in corresponding amounts,\" Chris Zacharias said.", "category": "technology"}, {"title": "Facebook bans breast cancer fundraising ads over nudity, criticised", "content": "Facebook was criticised after it banned Breast Cancer Network Australia's fundraising ads featuring topless cancer survivors covering themselves with baked goods, citing nudity rules. Facebook said it rejected the ads because they didn't contain messages like educating people about the disease. \"It's not nudity...it's a reality for so many...I will never be ashamed of my scars,\" said a survivor.", "category": "technology"}, {"title": "Flipkart co-founders backed startup 3D prints human cornea tissue", "content": "Bengaluru-based biotech startup Pandorum Technologies, the first Indian company to 3D print human liver tissue, has bio-engineered human cornea tissue to enable scarless healing of corneal wounds. Pandorum was founded in 2011 by IISc researchers Arun Chandru and Dr Tuhin Bhowmick. Its investors include Flipkart co-founders Sachin Bansal and Binny Bansal and Hero Group's Sunil Munjal among others.", "category": "technology"}, {"title": "E-mail warning Tesla employees from leaking data leaked", "content": "Tesla's security team warned staff against leaking sensitive information in an e-mail, leaked to CNBC. It read that outsiders, who would do anything to see Tesla fail, were targeting staff via social media and other methods to gain information. Employees were reminded of confidentiality agreements and warned that leaking proprietary business information will result in action against them.", "category": "technology"}, {"title": "YouTuber jailed for 10 years for asking explicit videos from minors", "content": "Austin Jones, a 26-year-old YouTuber from the US, has been jailed for 10 years for asking minor girls to send him sexually explicit videos. Jones had pleaded guilty to child pornography, having asked the girls for the videos to prove that they're his fans. He also told some of his victims that the videos were part of a modelling opportunity.", "category": "technology"}, {"title": "I will come to India, shoot a 'sorry India' song, jokes PewDiePie", "content": "Swedish YouTuber Felix Kjellberg 'PewDiePie' in a video jokingly said he'll come to India and shoot another song. \"My redemption song. It'll be a sad 'I'm sorry India' song. Like a ballad,\" he said. Recently, the Delhi High Court directed YouTube India to take down two of PewDiePie's songs criticising India amid competition with T-Series to become YouTube's most-followed channel.", "category": "technology"}, {"title": "No crime in Huawei leak: UK police after defence secy sacked", "content": "The British police has said the leak of information from UK's National Security Council that recently led to defence secretary Gavin Williamson's firing didn't constitute a crime, and declined to investigate the matter. The leak claimed that China's Huawei had been allowed to develop UK's 5G network. Williamson denied leaking discussions and had sought police investigation to clear his name.", "category": "technology"}, {"title": "Uber bars Co-founder Kalanick from NYSE opening bell ceremony: NYT", "content": "Uber is barring Co-founder Travis Kalanick from the opening bell ceremony at NYSE on May 10, the day Uber shares are set to begin trading, the New York Times reported. The 42-year-old resigned as the ride-hailing company's CEO in 2017 following pressure from investors. Kalanick, a current board member, remains one of the biggest Uber shareholders with an 8.6% stake.", "category": "technology"}, {"title": "Failed sapphire glass supplier for iPhone charged with fraud", "content": "GT Advanced Technologies and its ex-CEO Thomas Gutierrez were charged with misleading investors about the company's ability to supply \"sapphire glass\" for Apple's iPhones and misclassifying over $300 million-debt to Apple. In 2013, Apple agreed to give GT $578 million in four instalments for sapphire glass that met certain standards. In 2014, GT filed for bankruptcy and later exited it.", "category": "technology"}, {"title": "Bitcoin is like a seashell, not an investment: Warren Buffett", "content": "Berkshire Hathaway CEO Warren Buffett, while talking about Bitcoin said, \"It doesn't do anything. It just sits there. It's like a seashell or something, and that is not an investment to me.\" Buffett also called Bitcoin a \"gambling device\", which has many frauds connected with it. However, he acknowledged that blockchain technology holds promise, adding that it didn't need Bitcoin.", "category": "technology"}, {"title": "FB to focus on AI startups for its India Accelerator Program", "content": "Facebook has announced it has opened applications for the second edition of the 'India Innovation Accelerator' programme, which will focus especially on startups leveraging Artificial Intelligence (AI). The program runs in partnership with Hyderabad-based startup accelerator T-Hub. The call for application to participate in the program closes on June 2, 2019, the social media giant added.", "category": "technology"}, {"title": "Facebook's 8-year-serving execs made heads of 3 Instagram teams", "content": "Facebook has appointed three roughly eight-year veteran executives as head of Instagram's engineering, design and communications teams. Nam Nguyen, Luke Woods and Elisabeth Diana are now leading the respective divisions. Notably, Facebook had appointed veteran executive Adam Mosseri as the Head of Instagram last year after Instagram co-founders Kevin Systrom and Mike Krieger had quit.", "category": "technology"}, {"title": "Inaccurate, unfair: Xiaomi on reported Q1 phone shipment figures", "content": "China's Xiaomi has released a statement disputing the estimated smartphone shipment numbers for the first quarter of 2019 mentioned in media reports quoting \"certain market research institutions\". Calling the information \"inaccurate\" and \"unfair\", Xiaomi said it shipped over 27.5 million smartphones globally in the period. Market research firm IDC had pegged it at 25 million units.", "category": "technology"}, {"title": "US Air Force successfully shoots missiles with laser in test", "content": "The US Air Force in a test has successfully shot down air-launched missiles in flight with a ground-based laser system. Called the Self-Protect High Energy Laser Demonstrator (SHiELD), it's intended to eventually be mounted on an aircraft. In 2017, the US Air Force Research Lab awarded Lockheed Martin $26.3 million for design, development and production of high power fibre laser.", "category": "technology"}, {"title": "Microsoft unveils its own blockchain service", "content": "Microsoft has unveiled its own fully-managed blockchain service Azure Blockchain Service that allows for consortium blockchain networks' formation, management and governance. Unrelated to cryptocurrency, it'll let businesses build applications on top of blockchain technology. Microsoft partnered with JP Morgan to make Ethereum-based open source blockchain platform Quorum its first support ledger.", "category": "technology"}, {"title": "Facebook to shut down group video chat test app 'Bonfire'", "content": "Facebook has announced it is shutting down its test group video chat app 'Bonfire', adding, \"In May we'll be ending support for the Bonfire tests.\" \"We'll incorporate elements of what we learned into other current and future products,\" it said. The social media giant had begun testing the app in 2017 in Denmark.", "category": "technology"}, {"title": "17-yr-old finds bug in Dell PCs that exposed them to hacking", "content": "Dell has acknowledged a vulnerability on its pre-installed SupportAssist tool, reported by 17-year-old security researcher Bill Demirkapi, that exposed its laptops and computers to remote hacking. The bug allowed hackers on the same local network as their victim to install malicious software on PCs, if they visited a website controlled by the attacker. Dell provided a fix on April 23.", "category": "technology"}, {"title": "Google testing shopping links under YouTube videos: Report", "content": "Google is testing a new feature to include shopping links to products under videos and also display recommended products and their prices on its video-sharing platform YouTube, The Information reported. Clicking on links reportedly takes users to Google Express shopping service, which is presently available in the US. Google is also reportedly planning to rebrand the service to Google Shopping.", "category": "technology"}, {"title": "IBM-backed project makes WiFi network for natural disasters", "content": "Project OWL, which won IBM-hosted Call for Code competition last year, has created a network of WiFi-enabled IoT devices in rubber casings to help connect victims with first responders during natural disasters. In March, they tested their devices in Puerto Rico. They hope to get their network ready in small capacity for hurricane season in America's East Coast, beginning July.", "category": "technology"}, {"title": "Siddharth said he isn't ready: Madhu on son's wedding being cancelled", "content": "Priyanka Chopra's mother Madhu Chopra, while speaking about her son Siddharth Chopra's wedding being called off, said, \"My son Siddharth said he was not ready for marriage yet.\" \"He explained he needed more time,\" she added. Madhu had earlier said that Siddharth's wedding to Ishita Kumar has been \"mutually called off\".", "category": "entertainment"}, {"title": "Want to be known for who I am, not just as Mahesh's wife: Soni", "content": "Actress Soni Razdan has said although she's happy to be known as Mahesh Bhatt's wife or Alia Bhatt's mother, she'd like to be known for who she is. \"I'm also a person, who in her own right, has gone through...odds,\" she added. \"I've always been known as Mahesh's wife...This has always been a struggle,\" said Soni.", "category": "entertainment"}, {"title": "Fan chases Vaani Kapoor on bike in Mumbai, actress files complaint", "content": "Bollywood actress Vaani Kapoor, who appeared in films like 'Befikre' and 'Shuddh Desi Romance', has filed a police complaint against a fan who chased her on his bike from Versova to Bandra and back. Identified as Sameer Khan, the fan wanted to have a word with the actress. The fan refused to stop chasing even when her car's driver accelerated.", "category": "entertainment"}, {"title": "Apologise or we'll beat you: Karni Sena to Akhtar on ghunghat remark", "content": "Karni Sena had asked lyricist Javed Akhtar to apologise within three days for saying that if burqa is banned, then the practice of covering face with 'ghunghat' should also be stopped. \"We'll gouge out your eyes and pull out your tongue if you don't apologise. We'll enter your house and beat you,\" said the president of Karni Sena Maharashtra wing.", "category": "entertainment"}, {"title": "Endgame fastest movie to gross $2 billion, achieves feat in 11 days", "content": "'Avengers: Endgame' has become the fastest film to gross $2 billion, taking just 11 days to achieve the feat. The previous record was set by 'Avatar', which surpassed the $2-billion mark in 47 days from its release. Overall, 'Avengers: Endgame' is the fifth film to gross $2 billion after 'Avatar', 'Avengers: Infinity War', 'Star Wars: The Force Awakens' and 'Titanic'.", "category": "entertainment"}, {"title": "42-yr-old Australian DJ dies in Bali while helping injured friend", "content": "Australian DJ Adam Neat, aged 42, passed away in Bali after reportedly crashing through a glass door while trying to help an injured friend on Saturday. The female friend had fallen from the balcony of the resort they were staying at, reports added. Local police said alcohol was involved, reports further wrote.", "category": "entertainment"}, {"title": "'Avengers: Endgame' 1st Hollywood film to earn ₹300 crore in India", "content": "Marvel's superhero film 'Avengers: Endgame' became the first Hollywood film to cross the ₹300 crore mark in India on Sunday. The film has earned a total of ₹312.95 crore in India so far. It is the highest weekend opener in history and also the fastest movie to gross $2 billion worldwide, achieving the feat in 11 days.", "category": "entertainment"}, {"title": "Jackie Shroff once borrowed ₹5 from me to give to a beggar: Archana", "content": "Actress Archana Puran Singh revealed on 'The Kapil Sharma Show' that Jackie Shroff once borrowed ₹5 from her to give to a beggar. \"This is when we were struggling...Jaggu Dada was the kind of person who'd never let anyone asking for alms go...empty-handed,\" she added. Archana revealed this during an episode where Jackie's son Tiger had come as a guest.", "category": "entertainment"}, {"title": "Sanya to star in Monga's film whose documentary received Oscar", "content": "Actress Sanya Malhotra will star in an upcoming film produced by Guneet Monga, co-producer of the Oscar-winning documentary 'Period. End of Sentence'. \"We are doing a Hindi film...with Sanya...It's a coming of age story of a young girl in a small town,\" the filmmaker revealed. Guneet further praised the actress for her talent.", "category": "entertainment"}, {"title": "Teachers threaten misbehaving students with 'Endgame' spoilers", "content": "Social media users have posted pictures of teachers threatening students with 'Avengers: Endgame' spoilers to ensure good behaviour in class. One photo showed a teacher writing letter-by-letter a sentence spoiling part of the movie. Another picture showed the teacher wrote a sentence featuring the name \"Thanos\" followed by blank lines, threatening to fill them in when the class got loud.", "category": "entertainment"}, {"title": "Akshay's eligibility for National Award questioned over citizenship", "content": "Several social media users, including National Award-winning film editor-writer Apurva Asrani, questioned Akshay Kumar's eligibility for India's National Awards, as the actor is a Canadian citizen. Akshay had won the National Award for Best Actor in 2016. Following this, director Rahul Dholakia clarified while sharing a screenshot of the rulebook that foreign nationals can get National Awards.", "category": "entertainment"}, {"title": "Stop it, you don't need to explain: Kher to Akshay on citizenship row", "content": "Following Akshay Kumar's tweet wherein he wrote he has never hidden the fact that he holds a Canadian passport, actor Anupam Kher supported the actor and wrote, \"Stop it!...You are a doer. You don't need to explain to anybody.\" \"Their real profession is to make people like you & me feel defensive for talking in favour of India,\" he added.", "category": "entertainment"}, {"title": "Fans claim spotting Starbucks cup in GoT episode, share pic", "content": "Many Twitter users have claimed they spotted a Starbucks coffee cup in the latest episode of 'Game of Thrones'. \"Starbucks has opened up a branch in #Winterfell,\" a user commented. \"Before a long day of conquering Westeros and defeating Cersei, Dany needs a morning Starbucks,\" read another comment. Users also joked the makers missed it because of the dark lighting.", "category": "entertainment"}, {"title": "Know real from reel: Abhay shares his photoshopped and real pics", "content": "Actor Abhay Deol on Monday shared a collage of his photoshopped and real pictures on Instagram. He wrote, \"On the right - the real deal. On the left - the photoshopped fantasy. God bless technology but know the real from the reel!\" Commenting on the picture, a user wrote, \"Real looks so much better than photoshop version.\"", "category": "entertainment"}, {"title": "Karan Oberoi filmed female astrologer during rape for money: Police", "content": "Actor Karan Oberoi has been arrested for allegedly raping a female astrologer on the pretext of marriage. \"Oberoi not only raped the woman and filmed the act but also demanded money...threatening to release the video if she didn't pay up,\" said police. He is known for being part of 'A Band of Boys' and working in 'Jassi Jaisi Koi Nahin'.", "category": "entertainment"}, {"title": "Ranbir has a secret account, showed me how Instagram works: Katrina", "content": "Actress Katrina Kaif has revealed that her rumoured ex-boyfriend Ranbir Kapoor has a secret Instagram account to stalk people. \"And, Ranbir, by the way, was the person who showed me how Instagram works,\" she added. She further denied having a secret account of herself on the platform. The actress had officially joined Instagram in 2017.", "category": "entertainment"}, {"title": "Kylie saved up, built her own business : Kris on 'self-made' title", "content": "Kris Jenner, while defending her daughter Kylie Jenner for being named the youngest 'self-made billionaire' by Forbes in 2018, said, \"She saved up her own money and built this amazing business.\" \"My girls, you can say that certain things have been handed to them. But it takes a lot of work to do what they're all doing,\" she added.", "category": "entertainment"}, {"title": "Will tell kids how I met their father: Priyanka on pic with Nick", "content": "Ahead of Met Gala 2019, Priyanka Chopra shared on Instagram story a picture of herself with husband Nick Jonas from the 2017 Met Gala. \"The story I'll definitely tell our future kids...How I MET your father,\" she wrote. Priyanka and Nick, who weren't dating each other at that time, had made their first public appearance together at Met Gala 2017.", "category": "entertainment"}, {"title": "People are mean, obnoxious: Actress on man calling Pandya 'Kaalu'", "content": "After actress Krystle D'Souza shared a picture of herself with cricketer Hardik Pandya on Instagram, a user named Sameer commented, \"Kaalu bhai. Aap West Indies team ke world cup squad main select kyun nahi huye?\" \"People are so mean and obnoxious and just because they're sitting behind a screen typing, they think they can get away with anything,\" Krystle responded.", "category": "entertainment"}, {"title": "As a mother, I had to be strong: Soni on Shaheen's depression", "content": "Actress Soni Razdan, while speaking about her daughter Shaheen Bhatt who suffered from depression, said as a mother she had to be strong to \"take the right action to help Shaheen and to heal her\". \"Whether it is Alia or Shaheen, at any point in time, if they are suffering, I am the one who gets affected badly,\" she added.", "category": "entertainment"}, {"title": "Giving my kids phones nearly ended our relationship: Madonna", "content": "In an interview with Vogue UK, American singer Madonna said that she regrets giving her older children mobile phones when they were 13-years-old as it affected her relationship with them. \"It ended my relationship with them, really. Not completely, but it became a very...big part of their lives,\" Madonna said. The 60-year-old singer is a single mother of six children.", "category": "entertainment"}, {"title": "Owner said I couldn't handle it: Katrina on driving 1960s Land Rover", "content": "Katrina Kaif has shared a picture of herself driving a 1960s Land Rover for a scene in 'Bharat'. \"The man beside me is the actual owner of this classic 1960 s Land Rover, who was convinced I couldn't handle the car, while I was convinced I could,\" she wrote. 'Bharat', a historical period drama film, will release on June 5.", "category": "entertainment"}, {"title": "Sadak 2 isn't new beginning for me as director: Mahesh Bhatt", "content": "While speaking about his upcoming film 'Sadak 2', filmmaker Mahesh Bhatt said, \"I'm not intending to call it my second innings or a new beginning as a [director].\" The forthcoming film will mark Mahesh's return to direction after a gap of 20 years. \"I'm certainly not getting into that phase...where I will keep on directing films,\" the filmmaker further said.", "category": "entertainment"}, {"title": "Vivek Oberoi urges Delhi people to vote for PM Narendra Modi", "content": "Actor Vivek Oberoi campaigned on behalf of the BJP and urged the people of Delhi to vote for PM Narendra Modi on all seven parliamentary seats of the national capital. Addressing an event in Delhi, Oberoi said, \"All of us are chowkidars, who are armed and ready.\" He added that the chowkidars will never let the country suffer from loots.", "category": "entertainment"}, {"title": "Haven't yet made name for myself in Bollywood: Rakul Preet", "content": "Actress Rakul Preet Singh has said that she feels she hasn't made a name for herself in Bollywood as yet. \"I don't think I've done anything...I always keep saying that the fact that 'I'm an actor' hasn't sunk in,\" she added. \"I think there is still a lot more to do and I have just begun,\" Rakul Preet further said.", "category": "entertainment"}]